## Data Preparation

Preparation of Data.

In [1]:
import pandas as pd
import numpy as np

## **1. Data Input**

In [21]:
df_customer = pd.read_csv('C:/Users/hp/Downloads/PortoBuilder/Kalbe Internship/Final Project/Case Study Data Scientist/Case Study - Customer.csv', delimiter = ';') 
df_store = pd.read_csv('C:/Users/hp/Downloads/PortoBuilder/Kalbe Internship/Final Project/Case Study Data Scientist/Case Study - Store.csv', delimiter = ';')
df_product = pd.read_csv('C:/Users/hp/Downloads/PortoBuilder/Kalbe Internship/Final Project/Case Study Data Scientist/Case Study - Product.csv', delimiter = ';') 
df_transaction = pd.read_csv('C:/Users/hp/Downloads/PortoBuilder/Kalbe Internship/Final Project/Case Study Data Scientist/Case Study - Transaction.csv', delimiter = ';')

In [23]:
df_customer.shape, df_store.shape, df_product.shape, df_transaction.shape

((447, 5), (14, 6), (10, 3), (5020, 8))

In [32]:
df_customer.head()

   CustomerID  Age  Gender Marital Status Income
0           1   55       1        Married   5,12
1           2   60       1        Married   6,23
2           3   32       1        Married   9,17
3           4   31       1        Married   4,87
4           5   58       1        Married   3,57

In [33]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 447 entries, 0 to 446
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   CustomerID      447 non-null    int64
 1   Age             447 non-null    int64
 2   Gender          447 non-null    int64
 3   Marital Status  444 non-null    object
 4   Income          447 non-null    object
dtypes: int64(3), object(2)
memory usage: 17.6+ KB

In [49]:
df_store.head()

   StoreID         StoreName GroupStore           Type   Latitude   Longitude
0        1     Prima Tendean      Prima   Modern Trade       -6,2  106,816666
1        2  Prima Kelapa Dua      Prima   Modern Trade  -6,914864  107,608238
2        3        Prima Kota      Prima   Modern Trade  -7,797068  110,370529
3        4       Gita Ginara       Gita  General Trade  -6,966667  110,416664
4        5           Bonafid       Gita  General Trade  -7,250445  112,768845

In [50]:
df_store.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   StoreID     14 non-null     int64
 1   StoreName   14 non-null     object
 2   GroupStore  14 non-null     object
 3   Type        14 non-null     object
 4   Latitude    14 non-null     object
 5   Longitude   14 non-null     object
dtypes: int64(1), object(5)
memory usage: 804.0+ bytes

In [51]:
df_product.head()

  ProductID   Product Name  Price
0        P1      Choco Bar   8800
1        P2  Ginger Candy    3200
2        P3       Crackers   7500
3        P4    Potato Chip  12000
4        P5       Thai Tea   4200

In [52]:
df_product.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ProductID     10 non-null     object
 1   Product Name  10 non-null     object
 2   Price         10 non-null     int64
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

In [53]:
df_transaction.head()

,TransactionID,CustomerID,Date,ProductID,Price,Qty,TotalAmount,StoreID
0,TR11369,328,01/01/2022,P3,7500,4,30000,12
1,TR16356,165,01/01/2022,P9,10000,7,70000,1
2,TR1984,183,01/01/2022,P1,8800,4,35200,4
3,TR35256,160,01/01/2022,P1,8800,7,61600,4
4,TR41231,386,01/01/2022,P9,10000,1,10000,4

In [54]:
df_transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5020 entries, 0 to 5019
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   TransactionID  5020 non-null   object
 1   CustomerID     5020 non-null   int64
 2   Date           5020 non-null   object
 3   ProductID      5020 non-null   object
 4   Price          5020 non-null   int64
 5   Qty            5020 non-null   int64
 6   TotalAmount    5020 non-null   int64
 7   StoreID        5020 non-null   int64
dtypes: int64(5), object(3)
memory usage: 313.9+ KB

## **2. Data Cleansing**

**1. Fill mode for data Null in Customer Dataset**

In [56]:
# Print rows where 'Marital Status' column is null
null_marital_status = df_customer[df_customer['Marital Status'].isnull()]
print("Rows with null 'Marital Status' column:")
print(null_marital_status)

Rows with null 'Marital Status' column:
     CustomerID  Age  Gender Marital Status Income
9            10   34       1            NaN      4
415         416   27       1            NaN   3,43
442         443   33       1            NaN   9,28

In [58]:
# Fill null values in 'Marital Status' column with the mode
mode_marital_status = df_customer['Marital Status'].mode()[0]
df_customer['Marital Status'].fillna(mode_marital_status, inplace=True)

In [59]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 447 entries, 0 to 446
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   CustomerID      447 non-null    int64
 1   Age             447 non-null    int64
 2   Gender          447 non-null    int64
 3   Marital Status  447 non-null    object
 4   Income          447 non-null    object
dtypes: int64(3), object(2)
memory usage: 17.6+ KB

**2. Change longitude and latitude data type in store dataset**

In [61]:
# Remove non-numeric characters and whitespace from 'Latitude' and 'Longitude' columns
df_store['Latitude'] = df_store['Latitude'].str.replace('[^\d.]+', '', regex=True).astype(float)
df_store['Longitude'] = df_store['Longitude'].str.replace('[^\d.]+', '', regex=True).astype(float)

# Verify the changes
print(df_store.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   StoreID     14 non-null     int64
 1   StoreName   14 non-null     object
 2   GroupStore  14 non-null     object
 3   Type        14 non-null     object
 4   Latitude    14 non-null     float64
 5   Longitude   14 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 804.0+ bytes
None

**3. Fix data duplicate issue in transaction dataset**

In [62]:
# Check if 'TransactionID' column has duplicates
has_duplicate_transaction_ids = df_transaction['TransactionID'].duplicated().any()

if has_duplicate_transaction_ids:
    print("The 'TransactionID' column has duplicates.")
else:
    print("The 'TransactionID' column is unique.")

The 'TransactionID' column has duplicates.

In [63]:
# Check for duplicate rows based on 'TransactionID' column
duplicate_transaction_ids = df_transaction[df_transaction.duplicated(subset='TransactionID', keep=False)]

# Print the rows with duplicate 'TransactionID'
print("Rows with duplicate 'TransactionID':")
print(duplicate_transaction_ids)

Rows with duplicate 'TransactionID':
     TransactionID  CustomerID        Date ProductID  Price  Qty  TotalAmount  \
6          TR54287          51  01/01/2022        P8  16000    2        32000
17         TR26678         321  02/01/2022        P6  18000    3        54000
21         TR34291         333  02/01/2022        P7   9400    2        18800
52         TR41140          78  04/01/2022        P9  10000    2        20000
74         TR84132          22  05/01/2022        P9  10000    7        70000
...            ...         ...         ...       ...    ...  ...          ...
4876       TR91651         197  21/12/2022        P5   4200    2         8400
4910       TR57273         376  24/12/2022        P8  16000    1        16000
4916       TR75968         209  24/12/2022        P9  10000    7        70000
4921       TR18138         375  25/12/2022        P3   7500    6        45000
5000       TR26924         161  30/12/2022        P4  12000    3        36000

      StoreID
6           2
17         12
21          7
52         14
74         14
...       ...
4876        7
4910       11
4916       13
4921        4
5000        9

[223 rows x 8 columns]

In [66]:
#Proof
df_transaction[df_transaction.TransactionID == 'TR91651']

,TransactionID,CustomerID,Date,ProductID,Price,Qty,TotalAmount,StoreID
649,TR91651,234,16/02/2022,P3,7500,2,15000,8
4876,TR91651,197,21/12/2022,P5,4200,2,8400,7

In [71]:
# Convert the "Date" column to datetime data type with the correct format (assuming "dd/mm/yyyy")
df_transaction['Date'] = pd.to_datetime(df_transaction['Date'], format='%d/%m/%Y')

# Sort the DataFrame by 'TransactionID' and 'Date' in descending order
df_transaction.sort_values(by=['TransactionID', 'Date'], ascending=[True, False], inplace=True)

# Remove duplicates, keeping only the rows with the latest 'Date' for each 'TransactionID'
df_transaction.drop_duplicates(subset='TransactionID', keep='first', inplace=True)

# Reset the index if necessary
df_transaction.reset_index(drop=True, inplace=True)

# Print the updated DataFrame
print(df_transaction)

     TransactionID  CustomerID       Date ProductID  Price  Qty  TotalAmount  \
0          TR10008         235 2022-05-21        P8  16000    2        32000
1          TR10012         185 2022-12-27        P9  10000    2        20000
2          TR10026         164 2022-11-03        P6  18000    1        18000
3          TR10049         427 2022-09-18        P4  12000    1        12000
4          TR10055          21 2022-05-16       P10  15000    4        60000
...            ...         ...        ...       ...    ...  ...          ...
4903       TR99856         114 2022-03-29        P5   4200    5        21000
4904       TR99870         431 2022-03-07        P5   4200    4        16800
4905       TR99883         172 2022-11-11       P10  15000    2        30000
4906       TR99917         442 2022-07-24        P3   7500    1         7500
4907       TR99925         280 2022-10-25       P10  15000    5        75000

      StoreID
0           4
1           7
2          11
3           9
4           5
...       ...
4903       12
4904        8
4905       11
4906        5
4907       12

[4908 rows x 8 columns]

## **3. Merge Data**

In [72]:
df_merged = pd.merge (df_transaction, df_product, on= 'ProductID', how='left')
df_merged = pd.merge (df_merged, df_store, on= 'StoreID', how='inner')
df_merged = pd.merge (df_merged, df_customer, on= 'CustomerID', how='inner')

In [73]:
df_merged.head()

,TransactionID,CustomerID,Date,ProductID,Price_x,Qty,TotalAmount,StoreID,Product Name,Price_y,StoreName,GroupStore,Type,Latitude,Longitude,Age,Gender,Marital Status,Income
0,TR10008,235,2022-05-21,P8,16000,2,32000,4,Oat,16000,Gita Ginara,Gita,General Trade,6966667.0,110416664.0,37,0,Married,"5,35"
1,TR32057,235,2022-06-10,P7,9400,3,28200,7,Coffee Candy,9400,Buana Indah,Buana,General Trade,3316694.0,114590111.0,37,0,Married,"5,35"
2,TR47938,235,2022-10-18,P3,7500,4,30000,7,Crackers,7500,Buana Indah,Buana,General Trade,3316694.0,114590111.0,37,0,Married,"5,35"
3,TR49065,235,2022-10-08,P5,4200,4,16800,7,Thai Tea,4200,Buana Indah,Buana,General Trade,3316694.0,114590111.0,37,0,Married,"5,35"
4,TR50919,235,2022-08-18,P7,9400,4,37600,7,Coffee Candy,9400,Buana Indah,Buana,General Trade,3316694.0,114590111.0,37,0,Married,"5,35"

In [78]:
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4908 entries, 0 to 4907
Data columns (total 19 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   TransactionID   4908 non-null   object
 1   CustomerID      4908 non-null   int64
 2   Date            4908 non-null   datetime64[ns]
 3   ProductID       4908 non-null   object
 4   Price_x         4908 non-null   int64
 5   Qty             4908 non-null   int64
 6   TotalAmount     4908 non-null   int64
 7   StoreID         4908 non-null   int64
 8   Product Name    4908 non-null   object
 9   Price_y         4908 non-null   int64
 10  StoreName       4908 non-null   object
 11  GroupStore      4908 non-null   object
 12  Type            4908 non-null   object
 13  Latitude        4908 non-null   float64
 14  Longitude       4908 non-null   float64
 15  Age             4908 non-null   int64
 16  Gender          4908 non-null   int64
 17  Marital Status  4908 non-null   object
 18  Income          4908 non-null   object
dtypes: datetime64[ns](1), float64(2), int64(8), object(8)
memory usage: 728.7+ KB

In [77]:
df_merged.to_csv('C:/Users/hp/Downloads/PortoBuilder/Kalbe Internship/Final Project/Case Study Data Scientist/merged_data.csv', index=False)

In [80]:
!pip install nbformat
import nbformat

def ipynb_to_py(input_notebook, output_script):
    with open(input_notebook, 'r', encoding='utf-8') as nb_file:
        notebook = nbformat.read(nb_file, as_version=4)
    
    code_cells = []
    for cell in notebook.cells:
        if cell.cell_type == 'code':
            code_cells.append(cell.source)
    
    with open(output_script, 'w', encoding='utf-8') as py_file:
        py_file.write('\n'.join(code_cells))

# Replace 'input_notebook.ipynb' with the name of your input Jupyter Notebook file
# Replace 'output_script.py' with the desired name for the output Python script file
input_notebook = 'Data Prep.ipynb'
output_script = 'Data Prep.py'

ipynb_to_py(input_notebook, output_script)

[notice] A new release of pip is available: 23.2.1 -> 23.3.1
[notice] To update, run: C:\Users\hp\AppData\Local\Programs\Python\Python311\python.exe -m pip install --upgrade pip

Requirement already satisfied: nbformat in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (5.9.2)
Requirement already satisfied: fastjsonschema in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from nbformat) (2.18.1)
Requirement already satisfied: jsonschema>=2.6 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from nbformat) (4.19.1)
Requirement already satisfied: jupyter-core in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from nbformat) (5.3.2)
Requirement already satisfied: traitlets>=5.1 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from nbformat) (5.11.2)
Requirement already satisfied: attrs>=22.2.0 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from jsonschema>=2.6->nbformat) (23.1.0)
Requirement already satisfied: jsonschema-specifications>=2023.03.6 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from jsonschema>=2.6->nbformat) (2023.7.1)
Requirement already satisfied: referencing>=0.28.4 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from jsonschema>=2.6->nbformat) (0.30.2)
Requirement already satisfied: rpds-py>=0.7.1 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from jsonschema>=2.6->nbformat) (0.10.4)
Requirement already satisfied: platformdirs>=2.5 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from jupyter-core->nbformat) (3.11.0)
Requirement already satisfied: pywin32>=300 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from jupyter-core->nbformat) (306)